Revit 2027 API
AssetPropertyDouble.IsValidValue Method
 Checks that the value is a valid value for this property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	double value
)
Public Function IsValidValue (
	value As Double
) As Boolean
public:
bool IsValidValue(
	double value
)
member IsValidValue :
        value : float -> bool
Parameters
value Double
 The value to be checked.
Return Value
Boolean
 True if the value is valid for the property.
Exceptions
Exception | Condition
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace